In [1]:
import pandas as pd

In [2]:
# null values find, fill

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame({'Name':['Sourav','Komal','Jatin','Anshu',np.nan,'Anurag','Simran'],
                  'Class':['btech','bca','mca','btech','mcom','mba',np.nan],
                  'Rolllno':[34,np.nan,11,10,np.nan,67,89]})
df

     Name  Class  Rolllno
0  Sourav  btech     34.0
1   Komal    bca      NaN
2   Jatin    mca     11.0
3   Anshu  btech     10.0
4     NaN   mcom      NaN
5  Anurag    mba     67.0
6  Simran    NaN     89.0

In [5]:
df.isnull()

    Name  Class  Rolllno
0  False  False    False
1  False  False     True
2  False  False    False
3  False  False    False
4   True  False     True
5  False  False    False
6  False   True    False

In [6]:
df.isnull().sum()

Name       1
Class      1
Rolllno    2
dtype: int64

In [7]:
df.isna().sum()

Name       1
Class      1
Rolllno    2
dtype: int64

In [8]:
df.isnull().any()

Name       True
Class      True
Rolllno    True
dtype: bool

In [9]:
df.Name

0    Sourav
1     Komal
2     Jatin
3     Anshu
4       NaN
5    Anurag
6    Simran
Name: Name, dtype: object

In [10]:
df.Class

0    btech
1      bca
2      mca
3    btech
4     mcom
5      mba
6      NaN
Name: Class, dtype: object

In [11]:
df[df.Name.isnull()]

  Name Class  Rolllno
4  NaN  mcom      NaN

In [13]:
df[df.Rolllno.isnull()]

    Name Class  Rolllno
1  Komal   bca      NaN
4    NaN  mcom      NaN

In [15]:
df[df.Class.isnull()]

     Name Class  Rolllno
6  Simran   NaN     89.0

In [14]:
df[df['Class'].isnull()]

     Name Class  Rolllno
6  Simran   NaN     89.0

In [16]:
df.loc[1,'Rolllno'] = 23
df.loc[4,'Rolllno'] = 43
df

     Name  Class  Rolllno
0  Sourav  btech     34.0
1   Komal    bca     23.0
2   Jatin    mca     11.0
3   Anshu  btech     10.0
4     NaN   mcom     43.0
5  Anurag    mba     67.0
6  Simran    NaN     89.0

In [17]:
df['Class'].mode()

0    btech
Name: Class, dtype: object

In [18]:
df.loc[6,'Class'] = df['Class'].mode()[0]

In [19]:
df

     Name  Class  Rolllno
0  Sourav  btech     34.0
1   Komal    bca     23.0
2   Jatin    mca     11.0
3   Anshu  btech     10.0
4     NaN   mcom     43.0
5  Anurag    mba     67.0
6  Simran  btech     89.0

In [21]:
df.loc[6,'Class'] = 'bca'
df

     Name  Class  Rolllno
0  Sourav  btech     34.0
1   Komal    bca     23.0
2   Jatin    mca     11.0
3   Anshu  btech     10.0
4     NaN   mcom     43.0
5  Anurag    mba     67.0
6  Simran    bca     89.0

In [22]:
df1 = pd.DataFrame({'Name':['Sourav','Komal','Jatin','Anshu',np.nan,'Anurag','Simran'],
                  'Class':['btech','bca','mca','btech','mcom','mba',np.nan],
                  'Rolllno':[34,np.nan,11,10,np.nan,67,89]})
df1

     Name  Class  Rolllno
0  Sourav  btech     34.0
1   Komal    bca      NaN
2   Jatin    mca     11.0
3   Anshu  btech     10.0
4     NaN   mcom      NaN
5  Anurag    mba     67.0
6  Simran    NaN     89.0

In [23]:
df1.fillna(10)

     Name  Class  Rolllno
0  Sourav  btech     34.0
1   Komal    bca     10.0
2   Jatin    mca     11.0
3   Anshu  btech     10.0
4      10   mcom     10.0
5  Anurag    mba     67.0
6  Simran     10     89.0

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Class    7 non-null      object
 2   Rolllno  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 300.0+ bytes

In [25]:
df.describe()

         Rolllno
count   7.000000
mean   39.571429
std    29.449715
min    10.000000
25%    17.000000
50%    34.000000
75%    55.000000
max    89.000000

In [26]:
# Percentile
l = pd.DataFrame([12,17,14,19,20,21])
l

    0
0  12
1  17
2  14
3  19
4  20
5  21

In [27]:
l.describe()

               0
count   6.000000
mean   17.166667
std     3.544949
min    12.000000
25%    14.750000
50%    18.000000
75%    19.750000
max    21.000000

In [ ]:
# datasets - files reads excel files, json, csv files